app/controllers/admin/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `user_name`) VALUES ('thotranuet97@gmail.com', '$2a$11$2nGLvWKWMwoB4VLGWhh/P.dlum7oQ1GDToDGhvizy5Y1nr7prySwW', '2017-11-29 08:14:21', '2017-11-29 08:14:21', 'thotranuet')

  def edit
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1

  def lock
    @user = User.find_by(id: params[:user_id])
    @user.update_attribute(:lock, true)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `lock` = 1, `updated_at` = '2017-11-28 19:05:35' WHERE `users`.`id` = 1

  def unlock
    @user = User.find_by(id: params[:user_id])
    @user.update_attribute(:lock, false)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `lock` = 0, `updated_at` = '2017-11-29 05:50:20' WHERE `users`.`id` = 1