app/views/pics/hashtag.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`pic_id` = 1
---

                <h2>Tags: <%= raw pic.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %><h2>