app/views/pics/index.html.erb

              <% else %>
                <% @album = Album.find_by_id pic.album_id %>
---
SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1