app/views/pics/show.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`pic_id` = 18
---
      </p>
      <p><b>Tags: </b><%= raw @pic.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %></p>