app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @pic = Pic.find_by_id @comment.pic_id
    @comments = @pic.comments.all

    respond_to do |format|
      if @comment.save
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT `comments`.* FROM `comments` WHERE `comments`.`pic_id` = 15
INSERT INTO "comments" ("user_name", "body", "pic_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "lêu lêu"], ["body", "dạu ma"], ["pic_id", 4], ["created_at", "2017-11-21 11:37:33.210280"], ["updated_at", "2017-11-21 11:37:33.210280"], ["picture", "20-11-6.jpg"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE `comments` SET `body` = 'đẹp quá à', `updated_at` = '2017-11-30 03:24:25' WHERE `comments`.`id` = 4

  def destroy
    @comment.destroy
---
DELETE FROM `comments` WHERE `comments`.`id` = 1