app/controllers/users_controller.rb

SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 4
---
  def show
    @user = current_user
    @albums = current_user.albums.all

UPDATE `users` SET `user_name` = 'thotranuet97', `updated_at` = '2017-11-22 17:40:13' WHERE `users`.`id` = 3
---
  def update
    @user = current_user
    if @user.update(user_params)